Structure of the repository for reproducing the results of the article .........:
- =source=: original data (=bissau.txt=)
- =data=: processed data (=data-......csv=) and intermediate results from the analysis (=analysis-......csv=)
  + =data-bissau-processed.csv=: used for the analysis
  + =data-bissau-aggregated.csv=: not used for the analysis but exported for another project
- =tables=: tables in =docx= format.
- =figures=: figures in =pdf= and =png= format.
- =code=: contains R code for the whole analysis which can re-run by
  executing the file =0_main.R=. It empty the directories =data=,
  =figures=, and =tables= and then successively run the files:
  + =1_data.management.R=: data processing
  + =2_analysis.R=: data analysis
  + =3_figure1.R=, =4_figure2.R=: generate figures
  + =5_table1.R=, =6_table1.R=: generate tables

R and package versions:
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
library(Epi)
library(ggplot2)
library(multcomp)
library(officer)
library(Publish)
library(riskRegression)
library(data.table)
library(survival)
sessionInfo()
  #+END_SRC

  #+RESULTS:
  #+begin_example
  data.table 1.14.2 using 4 threads (see ?getDTthreads).  Latest news: r-datatable.com
  R version 4.2.0 (2022-04-22 ucrt)
  Platform: x86_64-w64-mingw32/x64 (64-bit)
  Running under: Windows 10 x64 (build 19045)

  Matrix products: default

  locale:
  [1] LC_COLLATE=Danish_Denmark.utf8  LC_CTYPE=Danish_Denmark.utf8   
  [3] LC_MONETARY=Danish_Denmark.utf8 LC_NUMERIC=C                   
  [5] LC_TIME=Danish_Denmark.utf8    

  attached base packages:
  [1] stats     graphics  grDevices utils     datasets  methods   base     

  other attached packages:
   [1] data.table_1.14.2         riskRegression_2023.07.26
   [3] testthat_3.1.4            multcomp_1.4-22          
   [5] TH.data_1.1-1             MASS_7.3-57              
   [7] mvtnorm_1.2-3             Publish_2020.12.23       
   [9] prodlim_2019.11.13        officer_0.5.1            
  [11] Epi_2.47                  ggplot2_3.4.3            
  [13] survival_3.3-1           

  loaded via a namespace (and not attached):
   [1] nlme_3.1-158        cmprsk_2.2-11       rms_6.3-0          
   [4] RColorBrewer_1.1-3  rprojroot_2.0.3     numDeriv_2016.8-1.1
   [7] butils_1.4.7        tools_4.2.0         backports_1.4.1    
  [10] utf8_1.2.3          R6_2.5.1            rpart_4.1.16       
  [13] Hmisc_4.7-0         mgcv_1.8-40         colorspace_2.1-0   
  [16] nnet_7.3-17         withr_2.5.1         tidyselect_1.2.0   
  [19] gridExtra_2.3       compiler_4.2.0      quantreg_5.93      
  [22] textshaping_0.3.6   cli_3.6.1           htmlTable_2.4.1    
  [25] SparseM_1.81        xml2_1.3.5          desc_1.4.1         
  [28] sandwich_3.0-2      labeling_0.4.3      scales_1.2.1       
  [31] checkmate_2.1.0     polspline_1.1.20    askpass_1.1        
  [34] stringr_1.5.0       systemfonts_1.0.4   digest_0.6.33      
  [37] foreign_0.8-84      base64enc_0.1-3     jpeg_0.1-9         
  [40] pkgconfig_2.0.3     htmltools_0.5.6     parallelly_1.34.0  
  [43] fastmap_1.1.1       htmlwidgets_1.6.2   rlang_1.1.1        
  [46] rstudioapi_0.13     farver_2.1.1        generics_0.1.3     
  [49] zoo_1.8-11          dplyr_1.1.3         zip_2.2.0          
  [52] magrittr_2.0.3      Formula_1.2-4       interp_1.1-3       
  [55] Matrix_1.5-1        Rcpp_1.0.11         waldo_0.4.0        
  [58] munsell_0.5.0       fansi_1.0.4         lifecycle_1.0.3    
  [61] stringi_1.7.12      brio_1.1.3          plyr_1.8.7         
  [64] grid_4.2.0          parallel_4.2.0      listenv_0.9.0      
  [67] mets_1.3.2          deldir_1.0-6        lattice_0.20-45    
  [70] splines_4.2.0       knitr_1.43          pillar_1.9.0       
  [73] timereg_2.0.2       uuid_1.1-0          boot_1.3-28        
  [76] future.apply_1.10.0 codetools_0.2-18    pkgload_1.3.0      
  [79] glue_1.6.2          latticeExtra_0.6-30 png_0.1-8          
  [82] vctrs_0.6.3         foreach_1.5.2       MatrixModels_0.5-0 
  [85] gtable_0.3.4        etm_1.1.1           openssl_2.0.2      
  [88] future_1.31.0       xfun_0.40           ragg_1.2.2         
  [91] tibble_3.2.1        iterators_1.0.14    cluster_2.1.3      
  [94] lava_1.7.2.1        globals_0.16.2
  #+end_example
